Revit 2026 API

# RebarConstraintSetToUseClearBarSpacing Method

---

Sets whether the RebarConstrainedHandle to target offset is the clear bar distance, or is measured between bar centers.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetToUseClearBarSpacing(
	bool useClearBarSpacing
)
```
```vb
Public Sub SetToUseClearBarSpacing (
	useClearBarSpacing As Boolean
)
```
```cpp
public:
void SetToUseClearBarSpacing(
	bool useClearBarSpacing
)
```
```fsharp
member SetToUseClearBarSpacing :
        useClearBarSpacing : bool -> unit
```

#### Parameters

useClearBarSpacing Boolean
     True if the RebarConstrainedHandle to target offset is the clear bar distance, false if the offset is measured between bar centers.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- The RebarConstraint constrain two Rebar ends. -or- The RebarTargetConstraintType is 'HookBend' or 'BarBend'. |

Throw exception if it's used on start/end handle to start/end handle constraint, and on constraints involving bar/hook bend handle.

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace